src/dtl/src/Catalogs/бир_События/бир_События.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>бир_События</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Ид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Обработка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЖизни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьСобытияСОшибками</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/dtl/src/Catalogs/бир_СобытияТочкиВозникновения/бир_СобытияТочкиВозникновения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>бир_СобытияТочкиВозникновения</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ЭтаИБ</name>
      <description>Эта ИБ</description>
    </items>
  </predefined>
  <attributes>
    <name>Ид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СервисСобытий_Адрес</name>
    <type>
      <types>CatalogRef.бир_АдресаСервисов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/dtl/src/CommonModules/бир_ВнешниеСобытияОбработкаЗапросов/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА ЗАПРОСОВ К СЕРВИСУ EventHUB
//
#Область ПрограммныйИнтерфейс

#Область ОбработкаЗапросовОбменаСобытиями

// Функция - Возвращает список зарегистрированных событий
//
// Параметры:
//  ВозвращатьВнешниеОбработки	 - Булево	 - Истина - в ответ будут включены внешние обработки проверки возникновения событий
// 
// Возвращаемое значение:
//   Массив (Структура) - Массив описаний зарегистрированных событий
//
Функция ПолучитьСписокЗарегистрированныхСобытий(ВозвращатьВнешниеОбработки = Ложь) Экспорт
	
	ЗапросСобытий = Новый Запрос("ВЫБРАТЬ
	                             |	События.Код,
	                             |	События.Наименование,
	                             |	События.Ид,
	                             |	События.Обработка,
	                             |	События.Комментарий
	                             |ИЗ
	                             |	Справочник.бир_События КАК События
	                             |ГДЕ
	                             |	НЕ События.ПометкаУдаления");
	
	Результат = ЗапросСобытий.Выполнить();
	
	МассивСобытий = Новый Массив();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОписаниеСобытия = ОписаниеСобытия();
		ЗаполнитьЗначенияСвойств(ОписаниеСобытия, Выборка);

		ВремОбработка = Выборка.Обработка.Получить();
		Если ТипЗнч(ВремОбработка) = Тип("ДвоичныеДанные") Тогда
			ОписаниеСобытия.ОбработкаВнешняя	= Истина;
			ОписаниеСобытия.Обработка			= ?(ВозвращатьВнешниеОбработки, Base64Строка(ВремОбработка), "<ВнешняяОбработка>");
		Иначе
			ОписаниеСобытия.Обработка = ВремОбработка;
		КонецЕсли;
		
		МассивСобытий.Добавить(ОписаниеСобытия);
	КонецЦикла;
	
	Возврат МассивСобытий;

КонецФункции // ПолучитьСписокЗарегистрированныхСобытий()

// Функция - Регистрирует переданные события и запускает обработку событий
//
// Параметры:
//  МассивСобытий     - Масив из Структура    - Массив описаний событий, которые необходимо
//                                              зарегистрировать и обработать (см. ОписаниеВнешнегоСобытия())
//  ОписаниеОшибок    - Строка                - Описание ошибок, возникших в процессе регистрации событий
// 
// Возвращаемое значение:
//   Булево - Истина - события зарегистрированы, Ложь - возникли ошибки
//
Функция ЗарегистрироватьСобытия(МассивСобытий, ОписаниеОшибок = "") Экспорт
	
	ОбязательныеПоля = Новый Структура("Источник_Ид, Источник_Наименование, ИдТочки");
	
	ОписаниеОшибок = "";
	
	Для й = 0 По МассивСобытий.ВГраница() Цикл
		Если НЕ ТипЗнч(МассивСобытий[й]) = Тип("Структура") Тогда
			ОписаниеОшибок = ОписаниеОшибок + ?(ОписаниеОшибок = "", "", Символы.ПС) + "Описание события (" + СокрЛП(й) + ") имеет тип """ + СокрЛП(ТипЗнч(МассивСобытий[й])) + """, ожидается тип ""Структура""!";
			Продолжить;
		КонецЕсли;
		Для Каждого ТекПоле Из ОбязательныеПоля Цикл
			Если НЕ МассивСобытий[й].Свойство(ТекПоле.Ключ) Тогда
				ОписаниеОшибок = ОписаниеОшибок + ?(ОписаниеОшибок = "", "", Символы.ПС) + "В описании события (" + СокрЛП(й) + ") отсутствует поле """ + ТекПоле.Ключ + """!";
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если НЕ ОписаниеОшибок = "" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого ТекСобытие Из МассивСобытий Цикл
		ТочкаВозникновения = Справочники.бир_СобытияТочкиВозникновения.НайтиПоРеквизиту("Ид", ТекСобытие.ИдТочки);
		ИдОбъектаМетаданныхТочки = бир_События.ИдентификаторОбъектаМетаданных(ТипЗнч(ТочкаВозникновения));
		
		Событие = Справочники.бир_События.ПустаяСсылка();
		Если ЗначениеЗаполнено(ТекСобытие.Приемник_Ид) Тогда
			Событие = Справочники.бир_События.НайтиПоРеквизиту("Ид", ТекСобытие.Приемник_Ид);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Событие) Тогда
			Событие = Справочники.бир_События.НайтиПоРеквизиту("Ид", ТекСобытие.Источник_Ид);
		КонецЕсли;
		
		Если ТочкаВозникновения.Пустая() ИЛИ Событие.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		
		СобытиеИОбработчики = бир_События.ПолучитьОбработчикиСобытий(ТочкаВозникновения, Событие);
		
		Если СобытиеИОбработчики.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеСобытия = бир_События.СтруктураОписанияСобытия(ТочкаВозникновения,
		                                                       ТекСобытие.ИдСобытия,
		                                                       ТочкаВозникновения,
		                                                       Событие,
		                                                       ТекСобытие.Дата,
		                                                       ТекСобытие.Момент,
															   ТекСобытие.ИдПервичный,
		                                                       ИдОбъектаМетаданныхТочки);
		бир_События.НачатьОбработкуСобытия(ОписаниеСобытия,
		                                   Пользователи.ТекущийПользователь(),
		                                   СобытиеИОбработчики[Событие],
		                                   ТекСобытие.Параметры);
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции // ЗарегистрироватьСобытия()

// Функция - Возвращает список точек возникновения событий
//
// Параметры:
//  ТекущаяТочка    - Булево    - Возвращать только точку возникновеня событий, соответствующую текущей ИБ
// 
// Возвращаемое значение:
//  Массив из Структура,    - Массив описаний зарегистрированных точек возникновения событий
//  Структура                 (см. ОписаниеТочкиВозникновенияСобытий())
//
Функция ПолучитьСписокТочекВозникновенияСобытий(ТекущаяТочка = Ложь) Экспорт
	
	ЗапросТочек = Новый Запрос("ВЫБРАТЬ
	                           |	ТочкиВозникновенияСобытий.Код КАК Код,
	                           |	ТочкиВозникновенияСобытий.Наименование КАК Наименование,
	                           |	ТочкиВозникновенияСобытий.Ид КАК Ид,
	                           |	ЕСТЬNULL(АдресаСервисов.Сервер, """") КАК Сервер,
	                           |	ЕСТЬNULL(АдресаСервисов.АдресРесурса, """") КАК АдресРесурса,
	                           |	ТочкиВозникновенияСобытий.Предопределенный КАК Предопределенный,
	                           |	ТочкиВозникновенияСобытий.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	                           |	ТочкиВозникновенияСобытий.Комментарий КАК Комментарий
	                           |ИЗ
	                           |	Справочник.бир_СобытияТочкиВозникновения КАК ТочкиВозникновенияСобытий
	                           |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бир_АдресаСервисов КАК АдресаСервисов
	                           |		ПО ТочкиВозникновенияСобытий.СервисСобытий_Адрес = АдресаСервисов.Ссылка
	                           |ГДЕ
	                           |	НЕ ТочкиВозникновенияСобытий.ПометкаУдаления
	                           |	И (&ТекущаяТочка
	                           |				И ТочкиВозникновенияСобытий.Предопределенный
	                           |			ИЛИ НЕ &ТекущаяТочка)");
								 
	ЗапросТочек.УстановитьПараметр("ТекущаяТочка", ТекущаяТочка);
	
	Результат = ЗапросТочек.Выполнить();
	
	МассивТочек = Новый Массив();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОписаниеТочки = ОписаниеТочкиВозникновенияСобытий();
		ЗаполнитьЗначенияСвойств(ОписаниеТочки, Выборка);
		МассивТочек.Добавить(ОписаниеТочки);
	КонецЦикла;
	
	Если ТекущаяТочка Тогда
		Возврат МассивТочек[0];
	Иначе
		Возврат МассивТочек;
	КонецЕсли;
	
КонецФункции // ПолучитьСписокТочекВозникновенияСобытий()

#КонецОбласти // ОбработкаЗапросовОбменаСобытиями

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс

// Функция - возвращает структуру описания точки возникновения событий
//
// Возвращаемое значение:
//  Структура                        - структура описания точки возникновения событий
//    *Ид                  - Строка    - идентификатор точки возникновения событий
//    *Код                 - Строка    - код точки возникновения событий
//    *Наименование        - Строка    - наименование точки возникновения событий
//    *Сервер              - Строка    - адрес сервера точки возникновения событий
//    *АдресРесурса        - Строка    - адрес ресурса точки возникновения событий на сервере
//    *Предопределенный    - Булево    - Истина - предопределенная точка возникновения событий
//    *Комментарий         - Строка    - описание точки возникновения событий
//
Функция ОписаниеТочкиВозникновенияСобытий() Экспорт

	ОписаниеТочки = Новый Структура();
	ОписаниеТочки.Вставить("Ид");
	ОписаниеТочки.Вставить("Код");
	ОписаниеТочки.Вставить("Наименование");
	ОписаниеТочки.Вставить("Сервер");
	ОписаниеТочки.Вставить("АдресРесурса");
	ОписаниеТочки.Вставить("Предопределенный");
	ОписаниеТочки.Вставить("Комментарий");

	Возврат ОписаниеТочки;

КонецФункции // ОписаниеТочкиВозникновенияСобытий()

// Функция - возвращает структуру описания внешнего события
//
// Возвращаемое значение:
//  Структура                                - структура описания события
//    *ИдСобытия                - Строка       - идентификатор события
//    *Источник_Наименование    - Строка       - наименование источника события
//    *Источник_Ид              - Строка       - идентификатор источника события
//    *Приемник_Наименование    - Строка       - наименование приемника события
//    *Приемник_Ид              - Строка       - идентификатор приемника события
//    *ИдТочки                  - Строка       - идентификатор точки возникновения события
//    *Дата                     - Дата         - дата и время возникновения события
//    *Момент                   - Число        - момент возникновения события (мс.)
//    *Параметры                - Структура    - параметры события
//
Функция ОписаниеВнешнегоСобытия() Экспорт

	ОписаниеСобытия = Новый Структура();
	ОписаниеСобытия.Вставить("ИдСобытия");
	ОписаниеСобытия.Вставить("Источник_Наименование");
	ОписаниеСобытия.Вставить("Источник_Ид");
	ОписаниеСобытия.Вставить("Приемник_Наименование");
	ОписаниеСобытия.Вставить("Приемник_Ид");
	ОписаниеСобытия.Вставить("ИдТочки");
	ОписаниеСобытия.Вставить("Дата");
	ОписаниеСобытия.Вставить("Момент");
	ОписаниеСобытия.Вставить("ИдПервичный");
	ОписаниеСобытия.Вставить("Параметры");

	Возврат ОписаниеСобытия;

КонецФункции // ОписаниеВнешнегоСобытия()

// Функция - возвращает структуру описания события
//
// Возвращаемое значение:
//  Структура                        - структура описания события
//    *Ид                  - Строка    - идентификатор события
//    *Код                 - Строка    - код события
//    *Наименование        - Строка    - наименование события
//    *ОбработкаВнешняя    - Булево    - Истина - используется внешняя обработка для проверки возникновения события
//    *Обработка           - Строка    - имя обработчика проверки возникновения события
//    *Комментарий         - Строка    - описание события
//
Функция ОписаниеСобытия() Экспорт

	ОписаниеСобытия = Новый Структура();
	ОписаниеСобытия.Вставить("Ид");
	ОписаниеСобытия.Вставить("Код");
	ОписаниеСобытия.Вставить("Наименование");
	ОписаниеСобытия.Вставить("ОбработкаВнешняя", Ложь);
	ОписаниеСобытия.Вставить("Обработка");
	ОписаниеСобытия.Вставить("Комментарий");

	Возврат ОписаниеСобытия;

КонецФункции // ОписаниеСобытия()

#КонецОбласти // СлужебныйПрограммныйИнтерфейс
